#!/bin/bash

# creado por nahfer sociedad hacking

setterm -foreground green

clear

echo "Ingresa El Menu con cual deseas Iniciar?"

echo " [1] Normal De Terminal
       [2] GNU Linux"


echo "
     
            ██████▓█████▓▓╬╬╬╬╬╬╬╬▓███▓╬╬╬╬╬╬╬▓╬╬▓█
            ████▓▓▓▓╬╬▓█████╬╬╬╬╬╬███▓╬╬╬╬╬╬╬╬╬╬╬╬╬█
            ███▓▓▓▓╬╬╬╬╬╬▓██╬╬╬╬╬╬▓▓╬╬╬╬╬╬╬╬╬╬╬╬╬╬▓█
            ████▓▓▓╬╬╬╬╬╬╬▓█▓╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬▓█
            ███▓█▓███████▓▓███▓╬╬╬╬╬╬▓███████▓╬╬╬╬▓█
            ████████████████▓█▓╬╬╬╬╬▓▓▓▓▓▓▓▓╬╬╬╬╬╬╬█
            ███▓▓▓▓▓▓▓▓▓▓▓▓▓▓█▓╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬▓█
            ████▓▓▓▓▓▓▓▓▓▓▓▓▓█▓╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬▓█
            ███▓█▓▓▓▓▓▓▓▓▓▓▓▓▓▓╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬▓█
            █████▓▓▓▓▓▓▓▓█▓▓▓█▓╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬▓█
            █████▓▓▓▓▓▓▓██▓▓▓█▓╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬██
            █████▓▓▓▓▓████▓▓▓█▓╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬██
            ████▓█▓▓▓▓██▓▓▓▓██╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬██
            ████▓▓███▓▓▓▓▓▓▓██▓╬╬╬╬╬╬╬╬╬╬╬╬█▓╬▓╬╬▓██
            █████▓███▓▓▓▓▓▓▓▓████▓▓╬╬╬╬╬╬╬█▓╬╬╬╬╬▓██
            █████▓▓█▓███▓▓▓████╬▓█▓▓╬╬╬▓▓█▓╬╬╬╬╬╬███
            ██████▓██▓███████▓╬╬╬▓▓╬▓▓██▓╬╬╬╬╬╬╬▓███
            ███████▓██▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓╬╬╬╬╬╬╬╬╬╬╬████
            ███████▓▓██▓▓▓▓▓╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬▓████
            ████████▓▓▓█████▓▓╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬▓█████
            █████████▓▓▓█▓▓▓▓▓███▓╬╬╬╬╬╬╬╬╬╬╬▓██████
            ██████████▓▓▓█▓▓▓▓▓██╬╬╬╬╬╬╬╬╬╬╬▓███████
            ███████████▓▓█▓▓▓▓███▓╬╬╬╬╬╬╬╬╬▓████████
            ██████████████▓▓▓███▓▓╬╬╬╬╬╬╬╬██████████
            ███████████████▓▓▓██▓▓╬╬╬╬╬╬▓███████████

"

echo "SOMOS NAHFER, SOMOS COMUNIDAD"
echo ""
echo "NAHFER HACKING PROGRAMATIONS"
echo ""
echo "LIDER SUPREMO:💎፝⃟༘┼⃢࿘✦❰COMANDO❱ ┼⃢𖣘✦ "
echo ""
echo "LIDERES ACTUALES:

  💎፝⃟༘┼⃢࿘✦❰CAPITAN COMANDO❱ ┼⃢𖣘✦
    Ꭼｌ贝Ｊｅｆｆｒｙ受👺🏴‍☠️
  💎፝⃟༘┼⃢࿘✦❰King of death❱ ┼⃢𖣘✦
  💎፝⃟༘┼⃢࿘✦❰The Demon 666❱ ┼⃢𖣘✦
  ✞💀ঔূ⃟৯ৣ ✰♕ Ɖꬳꬰꝱ✰♕ঔূ⃟ࣨ৯ৣ 💀
  💎፝⃟༘┼⃢࿘✦❰DESTROYER❱ ┼⃢𖣘✦
  💎፝⃟༘┼⃢࿘✦❰JHONNY HYOUDA❱ ┼⃢𖣘✦
  
  "
sleep 4

clear

echo "MIEMBROS ACTUALES Y ANTIGUOS:

💎፝⃟༘┼⃢࿘✦❰leo❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰suki❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰sr.max❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰sr.tobias❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰hectot❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰santa diabla❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰kine❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰luis❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰dr.julian❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰carol❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰el draak❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰el grow❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰infernuz❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰satan black❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰Megan❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰leo❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰suki❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰sr.max❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰sr.tobias❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰hectot❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰santa diabla❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰kine❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰luis❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰dr.julian❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰carol❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰el draak❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰el grow❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰infernuz❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰satan black❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰lord satán 999❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰𝗚𝗵𝗼𝘀𝘁❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰ *DESTROYER* ❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰sasuke❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰victor❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰janz❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰celeste❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰CODIGO❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰REYNA GOLD❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰DIOSA❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰HEROICO❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰VICTOR❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰VICTO❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰RAUL❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰SEBA❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰MATRIX❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰RODRIGO❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰DARK❱ ┼⃢𖣘 "

sleep 2

clear

echo "
💎፝⃟༘┼⃢࿘✦❰DARK CN❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰ESCOBAR❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰MARI❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰CODIGO❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰MARILU❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰OBITO❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰KING ZEUS❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰SATAN❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰THE KILLER MAX❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰CAPITAN ANONYMOUS❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰PRINCIPE❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰PRINCESS❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰EL HACKER❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰BOSS HACKER❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰PATRON❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰QUEEN❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰Sicario❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰HARLEY QUEEN❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰HARLEY❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰CARLOS❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰Maria❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰Expectus❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰Dayana❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰Eva❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰Sicaria❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰KING❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰KING DOKE❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰ALEDY❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰JOKER CN❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰KING DEMON❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰COMANDER X❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰DIABLITA❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰RENZO❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰LA DIABLA❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰DEMONIA❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰PREMIUM❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰DIABLA DE FUEGO❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰DIABLO❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰DIABLITO❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰JOKKER❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰BINARIO❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰Ludmila❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰Kratos❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰El oscuro❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰Arturo❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰Comunity❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰Rip❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰Histor❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰Cristoper❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰Anonymous❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰Anonimo❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰Comander alpha❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰Alpha❱ ┼⃢𖣘✦
💎፝⃟༘┼⃢࿘✦❰BINARIO❱ ┼⃢𖣘✦
  "
  
 sleep 2
 
 clear
 
 
 echo 
 
 while true; do
    read -p "
    
..######..########.##....##.########.########.....###....##......
.##....##.##.......###...##....##....##.....##...##.##...##......
.##.......##.......####..##....##....##.....##..##...##..##......
.##.......######...##.##.##....##....########..##.....##.##......
.##.......##.......##..####....##....##...##...#########.##......
.##....##.##.......##...###....##....##....##..##.....##.##......
..######..########.##....##....##....##.....##.##.....##.########
                                        
'##::: ##::::'###::::'##::::'##:'########:'########:'########::
 ###:: ##:::'## ##::: ##:::: ##: ##.....:: ##.....:: ##.... ##:
 ####: ##::'##:. ##:: ##:::: ##: ##::::::: ##::::::: ##:::: ##:
 ## ## ##:'##:::. ##: #########: ######::: ######::: ########::
 ##. ####: #########: ##.... ##: ##...:::: ##...:::: ##.. ##:::
 ##:. ###: ##.... ##: ##:::: ##: ##::::::: ##::::::: ##::. ##::
 ##::. ##: ##:::: ##: ##:::: ##: ##::::::: ########: ##:::. ##:
..::::..::..:::::..::..:::::..::..::::::::........::..:::::..::

╭━━━━━━━━━━━━━━╮
┃ ...   ••  ●  |      
┃██████████████┃ 
┃██████████████┃ 
┃██████████████┃
┃██████████████┃ 
┃██████████████┃ 
┃██████████████┃ 
┃██████████████┃ 
┃██████████████┃ 
┃██████████████┃ 
┃██████████████┃ 
┃██████████████┃
┃  #    =   >  ┃ 
╰━━━━━━━━━━━━━━╯

        [0] Botones nuevos
        [1] Contactame 
        [2] web Nahfer
        [3] acceder a comunidad Nahfer
        [4] Tools-Nahfer
        [5] Herramienta Doxing
        [6] Cursos en pdf 
        [7] Kali linux tools-Nahfer
        [8] Herramientas de pc
        [9] Sistemas operativos
       [10] Terminales 
       [11] Phishing
       [12] Ataque ddos
       [00]
       [~]~~>[Linux]$" op
             case $op in
             
            0* ) mkdir $HOME/.termux/ ;echo "extra-keys = [['ESC','/','-','HOME','UP','END','PGUP'],['TAB','CTRL','ALT','LEFT','DOWN','RIGHT','PGDN']]" >> $HOME/.termux/termux.properties; termux-reload-settings ; break;;
            1* ) termux-open http://wa.me/5491125443058 ; break;;
            
            2* ) cd a
            cd o
            j.sh; break;;
            
            3* ) termux-open https://chat.whatsapp.com/CzGpYyOCFZD7cHeVT3ngaq ; break;;
            
            4* ) 
            ls 
                cd Central-Nahfer
                cd a
                ls 
                chmod 711 tools.sh
                bash tools.sh ; break;;
                
            5* ) 
            ls
                cd Central-Nahfer
                cd a
                ls
                chmod 711 kaka.sh
                bash kaka.sh ; break;;
                
            6* ) 
                cd Central-Nahfer
            ls
                 cd a
                 chmod 711 c.sh
                 bash c.sh ; break;;
                
         * ) echo "opcion incorrecta.";;
    esac
    sleep 0.1
    clear
done
